In [6]:
import pandas as pd

In [8]:
pd.read_excel(r"C:\Users\United Computers\Desktop\data set 1.xlsx")

     Name       batch  Roll no     adress
0   alien  python-023        1      noida
1     bob    java-002       23      delhi
2  suzain  python-023       45  bangalore

In [13]:
pd.read_csv(r"C:\Users\United Computers\Desktop\data set 2.csv")

      Name       batch  Roll no     adress
0    alien  python-023        1      noida
1      bob    java-002       23      delhi
2   suzain  python-023       45  bangalore
3     alex    java-002       67      noida
4  prakash  python-023       25      delhi